<a href="https://colab.research.google.com/github/carlosfmorenog/CMM202/blob/master/CMM202_Topic_3/CMM202_T3_Lec.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# CMM202 Topic 3: Manipulating Columns & Missing Data

## Data by Columns

In [ ]:
# Importing a dataset that I have in dropbox
import pandas as pd
url = 'https://www.dropbox.com/s/ju1iemc8k1wp0p5/time.csv?raw=1'
time = pd.read_csv(url)
time

,Year,Honor,Name,Country,Birth Year,Death Year,Title,Category,Context
0,1927,Man of the Year,Charles Lindbergh,United States,1902.0,1974.0,US Air Mail Pilot,NaN,First Solo Transatlantic Flight
1,1928,Man of the Year,Walter Chrysler,United States,1875.0,1940.0,Founder of Chrysler,Economics,Chrysler/Dodge Merger
2,1929,Man of the Year,Owen D. Young,United States,1874.0,1962.0,Member of the German Reparations International...,Diplomacy,Young Plan
3,1930,Man of the Year,Mahatma Gandhi,India,1869.0,1948.0,NaN,Revolution,Salt March
4,1931,Man of the Year,Pierre Laval,France,1883.0,1945.0,Prime Minister of France,Politics,NaN
...,...,...,...,...,...,...,...,...,...
86,2012,Person of the Year,Barack Obama,United States,1961.0,NaN,President of the United States,Politics,Presidential Election
87,2013,Person of the Year,Pope Francis,Vatican City,1936.0,NaN,Pope of the Roman Catholic Church,Religion,Papal Conclave
88,2014,Person of the Year,The Ebola Fighters,NaN,NaN,NaN,NaN,Science,Ebola Epidemic
89,2015,Person of the Year,Angela Merkel,Germany,1954.0,NaN,Chancellor of Germany,Politics,Debt Crisis; Refugee Crisis; Paris Terrorist A...
90,2016,Person of the Year,Donald Trump,United States,1946.0,NaN,President of the United States,Politics,Presidential Election

This dataset contains the list of people named Man/Person of the Year by Times magazine

Last week we added new columns to dataframes

    The dog/cat class at the end of the image repository
    The "watched" column at the end of the Netflix dataset

Today, we will learn other ways in which we can manipulate, add or relate data from columns

### Mapping Columns

Sometimes we want to convert a column of categorical data from strings (text) to integers (numbers)

We can define a `dictionary` which maps the strings (as keys) to integers (as values) using the `map` method

Another option is to define a `set` of the unique categories as follows.

In [ ]:
categories = set(time['Category'])
categories

{'Diplomacy',
 'Economics',
 'Environment',
 'Media',
 'Philanthropy',
 'Politics',
 'Religion',
 'Revolution',
 'Science',
 'Space',
 'Technology',
 'War',
 nan}

Then, we can then assign unique numbers to this `set` as a `dictionary` (defined in Python using the `{}`)

In [ ]:
mapping = {category : index for index, category in enumerate(categories)}
mapping

{nan: 0,
 'Technology': 1,
 'Philanthropy': 2,
 'Space': 3,
 'Diplomacy': 4,
 'Politics': 5,
 'Environment': 6,
 'Science': 7,
 'Media': 8,
 'Revolution': 9,
 'Religion': 10,
 'War': 11,
 'Economics': 12}

We now have a `map` which allows us to convert from a category string to an `int`. For example:

In [ ]:
mapping['Diplomacy']

4

In [ ]:
mapping['Media']

8

We can use the `map` method on the chosen column to do the conversion

The `map` method takes our `dictionary` as an argument and returns a new column with the mapping applied

In [ ]:
time['Category'].map(mapping)

0      0
1     12
2      4
3      9
4      5
      ..
86     5
87    10
88     7
89     5
90     5
Name: Category, Length: 91, dtype: int64

If we wanted to overwrite the `Category` column with our new mapped values, we could do:

    time['Category'] = time['Category'].map(mapping)

However, it may be best to keep both. So we can instead assign it a different column name

In [ ]:
time['Category Ordinal'] = time['Category'].map(mapping)
time

,Year,Honor,Name,Country,Birth Year,Death Year,Title,Category,Context,Category Ordinal
0,1927,Man of the Year,Charles Lindbergh,United States,1902.0,1974.0,US Air Mail Pilot,NaN,First Solo Transatlantic Flight,0
1,1928,Man of the Year,Walter Chrysler,United States,1875.0,1940.0,Founder of Chrysler,Economics,Chrysler/Dodge Merger,12
2,1929,Man of the Year,Owen D. Young,United States,1874.0,1962.0,Member of the German Reparations International...,Diplomacy,Young Plan,4
3,1930,Man of the Year,Mahatma Gandhi,India,1869.0,1948.0,NaN,Revolution,Salt March,9
4,1931,Man of the Year,Pierre Laval,France,1883.0,1945.0,Prime Minister of France,Politics,NaN,5
...,...,...,...,...,...,...,...,...,...,...
86,2012,Person of the Year,Barack Obama,United States,1961.0,NaN,President of the United States,Politics,Presidential Election,5
87,2013,Person of the Year,Pope Francis,Vatican City,1936.0,NaN,Pope of the Roman Catholic Church,Religion,Papal Conclave,10
88,2014,Person of the Year,The Ebola Fighters,NaN,NaN,NaN,NaN,Science,Ebola Epidemic,7
89,2015,Person of the Year,Angela Merkel,Germany,1954.0,NaN,Chancellor of Germany,Politics,Debt Crisis; Refugee Crisis; Paris Terrorist A...,5
90,2016,Person of the Year,Donald Trump,United States,1946.0,NaN,President of the United States,Politics,Presidential Election,5

### Manipulating Numerical Columns

We can perform arithmetic between columns as if they were simply numbers

We will take the column `Death Year`, subtract the column `Birth Year`, and storing the result in a (new) column called `Lifespan`

In [ ]:
time['Lifespan'] = time['Death Year'] - time['Birth Year']
time

,Year,Honor,Name,Country,Birth Year,Death Year,Title,Category,Context,Category Ordinal,Lifespan
0,1927,Man of the Year,Charles Lindbergh,United States,1902.0,1974.0,US Air Mail Pilot,NaN,First Solo Transatlantic Flight,0,72.0
1,1928,Man of the Year,Walter Chrysler,United States,1875.0,1940.0,Founder of Chrysler,Economics,Chrysler/Dodge Merger,12,65.0
2,1929,Man of the Year,Owen D. Young,United States,1874.0,1962.0,Member of the German Reparations International...,Diplomacy,Young Plan,4,88.0
3,1930,Man of the Year,Mahatma Gandhi,India,1869.0,1948.0,NaN,Revolution,Salt March,9,79.0
4,1931,Man of the Year,Pierre Laval,France,1883.0,1945.0,Prime Minister of France,Politics,NaN,5,62.0
...,...,...,...,...,...,...,...,...,...,...,...
86,2012,Person of the Year,Barack Obama,United States,1961.0,NaN,President of the United States,Politics,Presidential Election,5,NaN
87,2013,Person of the Year,Pope Francis,Vatican City,1936.0,NaN,Pope of the Roman Catholic Church,Religion,Papal Conclave,10,NaN
88,2014,Person of the Year,The Ebola Fighters,NaN,NaN,NaN,NaN,Science,Ebola Epidemic,7,NaN
89,2015,Person of the Year,Angela Merkel,Germany,1954.0,NaN,Chancellor of Germany,Politics,Debt Crisis; Refugee Crisis; Paris Terrorist A...,5,NaN
90,2016,Person of the Year,Donald Trump,United States,1946.0,NaN,President of the United States,Politics,Presidential Election,5,NaN

Notice that the method acknowledged that some columns were `NaN` (since the person is still alive) and thus put a `NaN` as a result in the lifespan column.

Sometimes you want to do "more difficult" numerical conversions

In those cases it is more convenient to define a **function** and then use the `apply` method

In this example, we will define a function to convert years to decades to be applied in the different columns that contain years

In [ ]:
def to_decade(value):
    return 10 * (value // 10)

In [ ]:
10*(1956//10)

1950

First we should test our function on some examples to ensure the function is correct.

In [ ]:
to_decade(1971)

1970

Now we can use `apply` to transform the entire column `Birth Year` into the corresponding decade

In [ ]:
time['Birth Decade'] = time['Birth Year'].apply(to_decade)
time

,Year,Honor,Name,Country,Birth Year,Death Year,Title,Category,Context,Category Ordinal,Lifespan,Birth Decade
0,1927,Man of the Year,Charles Lindbergh,United States,1902.0,1974.0,US Air Mail Pilot,NaN,First Solo Transatlantic Flight,0,72.0,1900.0
1,1928,Man of the Year,Walter Chrysler,United States,1875.0,1940.0,Founder of Chrysler,Economics,Chrysler/Dodge Merger,12,65.0,1870.0
2,1929,Man of the Year,Owen D. Young,United States,1874.0,1962.0,Member of the German Reparations International...,Diplomacy,Young Plan,4,88.0,1870.0
3,1930,Man of the Year,Mahatma Gandhi,India,1869.0,1948.0,NaN,Revolution,Salt March,9,79.0,1860.0
4,1931,Man of the Year,Pierre Laval,France,1883.0,1945.0,Prime Minister of France,Politics,NaN,5,62.0,1880.0
...,...,...,...,...,...,...,...,...,...,...,...,...
86,2012,Person of the Year,Barack Obama,United States,1961.0,NaN,President of the United States,Politics,Presidential Election,5,NaN,1960.0
87,2013,Person of the Year,Pope Francis,Vatican City,1936.0,NaN,Pope of the Roman Catholic Church,Religion,Papal Conclave,10,NaN,1930.0
88,2014,Person of the Year,The Ebola Fighters,NaN,NaN,NaN,NaN,Science,Ebola Epidemic,7,NaN,NaN
89,2015,Person of the Year,Angela Merkel,Germany,1954.0,NaN,Chancellor of Germany,Politics,Debt Crisis; Refugee Crisis; Paris Terrorist A...,5,NaN,1950.0
90,2016,Person of the Year,Donald Trump,United States,1946.0,NaN,President of the United States,Politics,Presidential Election,5,NaN,1940.0

### Manipulating String Columns

`apply` can also be used on strings

For example, we can apply the `len` function to `Name` to get the number of characters in each name.

In [ ]:
time['Name Length'] = time['Name'].apply(len)
time

,Year,Honor,Name,Country,Birth Year,Death Year,Title,Category,Context,Category Ordinal,Lifespan,Birth Decade,Name Length
0,1927,Man of the Year,Charles Lindbergh,United States,1902.0,1974.0,US Air Mail Pilot,NaN,First Solo Transatlantic Flight,0,72.0,1900.0,17
1,1928,Man of the Year,Walter Chrysler,United States,1875.0,1940.0,Founder of Chrysler,Economics,Chrysler/Dodge Merger,12,65.0,1870.0,15
2,1929,Man of the Year,Owen D. Young,United States,1874.0,1962.0,Member of the German Reparations International...,Diplomacy,Young Plan,4,88.0,1870.0,13
3,1930,Man of the Year,Mahatma Gandhi,India,1869.0,1948.0,NaN,Revolution,Salt March,9,79.0,1860.0,14
4,1931,Man of the Year,Pierre Laval,France,1883.0,1945.0,Prime Minister of France,Politics,NaN,5,62.0,1880.0,12
...,...,...,...,...,...,...,...,...,...,...,...,...,...
86,2012,Person of the Year,Barack Obama,United States,1961.0,NaN,President of the United States,Politics,Presidential Election,5,NaN,1960.0,12
87,2013,Person of the Year,Pope Francis,Vatican City,1936.0,NaN,Pope of the Roman Catholic Church,Religion,Papal Conclave,10,NaN,1930.0,12
88,2014,Person of the Year,The Ebola Fighters,NaN,NaN,NaN,NaN,Science,Ebola Epidemic,7,NaN,NaN,18
89,2015,Person of the Year,Angela Merkel,Germany,1954.0,NaN,Chancellor of Germany,Politics,Debt Crisis; Refugee Crisis; Paris Terrorist A...,5,NaN,1950.0,13
90,2016,Person of the Year,Donald Trump,United States,1946.0,NaN,President of the United States,Politics,Presidential Election,5,NaN,1940.0,12

Another example, we can create a function to get the initials from a name.

In [ ]:
# First we define the function
def to_initials(name):
    import numpy as np # we need this for Python to know what NaN is!
    if name == np.NaN:
        return np.NaN
    else:
        initials = ""
        for word in name.split(' '):
            first_letter = word[0]
            initials += first_letter
        return initials
    # Then, we try it
to_initials("Barack Obama")

'BO'

Applying this gives us a name column with the person's initials.

In [ ]:
time['Initials'] = time['Name'].apply(to_initials)
time

,Year,Honor,Name,Country,Birth Year,Death Year,Title,Category,Context,Category Ordinal,Lifespan,Birth Decade,Name Length,Initials
0,1927,Man of the Year,Charles Lindbergh,United States,1902.0,1974.0,US Air Mail Pilot,NaN,First Solo Transatlantic Flight,0,72.0,1900.0,17,CL
1,1928,Man of the Year,Walter Chrysler,United States,1875.0,1940.0,Founder of Chrysler,Economics,Chrysler/Dodge Merger,12,65.0,1870.0,15,WC
2,1929,Man of the Year,Owen D. Young,United States,1874.0,1962.0,Member of the German Reparations International...,Diplomacy,Young Plan,4,88.0,1870.0,13,ODY
3,1930,Man of the Year,Mahatma Gandhi,India,1869.0,1948.0,NaN,Revolution,Salt March,9,79.0,1860.0,14,MG
4,1931,Man of the Year,Pierre Laval,France,1883.0,1945.0,Prime Minister of France,Politics,NaN,5,62.0,1880.0,12,PL
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
86,2012,Person of the Year,Barack Obama,United States,1961.0,NaN,President of the United States,Politics,Presidential Election,5,NaN,1960.0,12,BO
87,2013,Person of the Year,Pope Francis,Vatican City,1936.0,NaN,Pope of the Roman Catholic Church,Religion,Papal Conclave,10,NaN,1930.0,12,PF
88,2014,Person of the Year,The Ebola Fighters,NaN,NaN,NaN,NaN,Science,Ebola Epidemic,7,NaN,NaN,18,TE
89,2015,Person of the Year,Angela Merkel,Germany,1954.0,NaN,Chancellor of Germany,Politics,Debt Crisis; Refugee Crisis; Paris Terrorist A...,5,NaN,1950.0,13,AM
90,2016,Person of the Year,Donald Trump,United States,1946.0,NaN,President of the United States,Politics,Presidential Election,5,NaN,1940.0,12,DT

In [ ]:
import numpy as np
np.isnan(time.at[90,'Death Year'])

True

In [ ]:
def to_int(value):
    if np.isnan(value)==False:
        value = int(value)
    return value
# Won't make a difference because NaN makes all column float
time['Death Year'] = time['Death Year'].apply(to_int)
time

,Year,Honor,Name,Country,Birth Year,Death Year,Title,Category,Context,Category Ordinal,Lifespan,Birth Decade,Name Length,Initials
0,1927,Man of the Year,Charles Lindbergh,United States,1902.0,1974.0,US Air Mail Pilot,NaN,First Solo Transatlantic Flight,0,72.0,1900.0,17,CL
1,1928,Man of the Year,Walter Chrysler,United States,1875.0,1940.0,Founder of Chrysler,Economics,Chrysler/Dodge Merger,12,65.0,1870.0,15,WC
2,1929,Man of the Year,Owen D. Young,United States,1874.0,1962.0,Member of the German Reparations International...,Diplomacy,Young Plan,4,88.0,1870.0,13,ODY
3,1930,Man of the Year,Mahatma Gandhi,India,1869.0,1948.0,NaN,Revolution,Salt March,9,79.0,1860.0,14,MG
4,1931,Man of the Year,Pierre Laval,France,1883.0,1945.0,Prime Minister of France,Politics,NaN,5,62.0,1880.0,12,PL
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
86,2012,Person of the Year,Barack Obama,United States,1961.0,NaN,President of the United States,Politics,Presidential Election,5,NaN,1960.0,12,BO
87,2013,Person of the Year,Pope Francis,Vatican City,1936.0,NaN,Pope of the Roman Catholic Church,Religion,Papal Conclave,10,NaN,1930.0,12,PF
88,2014,Person of the Year,The Ebola Fighters,NaN,NaN,NaN,NaN,Science,Ebola Epidemic,7,NaN,NaN,18,TE
89,2015,Person of the Year,Angela Merkel,Germany,1954.0,NaN,Chancellor of Germany,Politics,Debt Crisis; Refugee Crisis; Paris Terrorist A...,5,NaN,1950.0,13,AM
90,2016,Person of the Year,Donald Trump,United States,1946.0,NaN,President of the United States,Politics,Presidential Election,5,NaN,1940.0,12,DT

### Removing Columns (Unwanted Variables)

There are two main ways to remove them, either we specify which columns we want to **keep** or we specify which we want to **remove**

Here is the version where we specify, by name, which columns to **keep**. You saw this in an earlier lecture as selecting columns.

In [ ]:
time[['Honor', 'Year', 'Name']] # order

                 Honor  Year                Name
0      Man of the Year  1927   Charles Lindbergh
1      Man of the Year  1928     Walter Chrysler
2      Man of the Year  1929       Owen D. Young
3      Man of the Year  1930      Mahatma Gandhi
4      Man of the Year  1931        Pierre Laval
..                 ...   ...                 ...
86  Person of the Year  2012        Barack Obama
87  Person of the Year  2013        Pope Francis
88  Person of the Year  2014  The Ebola Fighters
89  Person of the Year  2015       Angela Merkel
90  Person of the Year  2016        Donald Trump

[91 rows x 3 columns]

Here is the version where we specify, by name, which columns to **remove**

In [ ]:
time.drop(columns=['Year', 'Honor', 'Name'])

,Country,Birth Year,Death Year,Title,Category,Context,Category Ordinal,Lifespan,Birth Decade,Name Length,Initials
0,United States,1902.0,1974.0,US Air Mail Pilot,NaN,First Solo Transatlantic Flight,0,72.0,1900.0,17,CL
1,United States,1875.0,1940.0,Founder of Chrysler,Economics,Chrysler/Dodge Merger,12,65.0,1870.0,15,WC
2,United States,1874.0,1962.0,Member of the German Reparations International...,Diplomacy,Young Plan,4,88.0,1870.0,13,ODY
3,India,1869.0,1948.0,NaN,Revolution,Salt March,9,79.0,1860.0,14,MG
4,France,1883.0,1945.0,Prime Minister of France,Politics,NaN,5,62.0,1880.0,12,PL
...,...,...,...,...,...,...,...,...,...,...,...
86,United States,1961.0,NaN,President of the United States,Politics,Presidential Election,5,NaN,1960.0,12,BO
87,Vatican City,1936.0,NaN,Pope of the Roman Catholic Church,Religion,Papal Conclave,10,NaN,1930.0,12,PF
88,NaN,NaN,NaN,NaN,Science,Ebola Epidemic,7,NaN,NaN,18,TE
89,Germany,1954.0,NaN,Chancellor of Germany,Politics,Debt Crisis; Refugee Crisis; Paris Terrorist A...,5,NaN,1950.0,13,AM
90,United States,1946.0,NaN,President of the United States,Politics,Presidential Election,5,NaN,1940.0,12,DT

To apply the changes, assign the result back to the same variable `time`

In [ ]:
time = time.drop(columns=['Year', 'Honor', 'Name'])
time

,Country,Birth Year,Death Year,Title,Category,Context,Category Ordinal,Lifespan,Birth Decade,Name Length,Initials
0,United States,1902.0,1974.0,US Air Mail Pilot,NaN,First Solo Transatlantic Flight,0,72.0,1900.0,17,CL
1,United States,1875.0,1940.0,Founder of Chrysler,Economics,Chrysler/Dodge Merger,12,65.0,1870.0,15,WC
2,United States,1874.0,1962.0,Member of the German Reparations International...,Diplomacy,Young Plan,4,88.0,1870.0,13,ODY
3,India,1869.0,1948.0,NaN,Revolution,Salt March,9,79.0,1860.0,14,MG
4,France,1883.0,1945.0,Prime Minister of France,Politics,NaN,5,62.0,1880.0,12,PL
...,...,...,...,...,...,...,...,...,...,...,...
86,United States,1961.0,NaN,President of the United States,Politics,Presidential Election,5,NaN,1960.0,12,BO
87,Vatican City,1936.0,NaN,Pope of the Roman Catholic Church,Religion,Papal Conclave,10,NaN,1930.0,12,PF
88,NaN,NaN,NaN,NaN,Science,Ebola Epidemic,7,NaN,NaN,18,TE
89,Germany,1954.0,NaN,Chancellor of Germany,Politics,Debt Crisis; Refugee Crisis; Paris Terrorist A...,5,NaN,1950.0,13,AM
90,United States,1946.0,NaN,President of the United States,Politics,Presidential Election,5,NaN,1940.0,12,DT

### Renaming Columns

You can do this using a `dictionary`

In [ ]:
time = time.rename(columns={'Birth Year' : 'Born',
                        'Death Year' : 'Died'})
time

,Country,Born,Died,Title,Category,Context,Category Ordinal,Lifespan,Birth Decade,Name Length,Initials
0,United States,1902.0,1974.0,US Air Mail Pilot,NaN,First Solo Transatlantic Flight,0,72.0,1900.0,17,CL
1,United States,1875.0,1940.0,Founder of Chrysler,Economics,Chrysler/Dodge Merger,12,65.0,1870.0,15,WC
2,United States,1874.0,1962.0,Member of the German Reparations International...,Diplomacy,Young Plan,4,88.0,1870.0,13,ODY
3,India,1869.0,1948.0,NaN,Revolution,Salt March,9,79.0,1860.0,14,MG
4,France,1883.0,1945.0,Prime Minister of France,Politics,NaN,5,62.0,1880.0,12,PL
...,...,...,...,...,...,...,...,...,...,...,...
86,United States,1961.0,NaN,President of the United States,Politics,Presidential Election,5,NaN,1960.0,12,BO
87,Vatican City,1936.0,NaN,Pope of the Roman Catholic Church,Religion,Papal Conclave,10,NaN,1930.0,12,PF
88,NaN,NaN,NaN,NaN,Science,Ebola Epidemic,7,NaN,NaN,18,TE
89,Germany,1954.0,NaN,Chancellor of Germany,Politics,Debt Crisis; Refugee Crisis; Paris Terrorist A...,5,NaN,1950.0,13,AM
90,United States,1946.0,NaN,President of the United States,Politics,Presidential Election,5,NaN,1940.0,12,DT

In [ ]:
# inplace helps make changes without =
time.rename(columns={'Born' : 'B',
                        'Died' : 'D'}, inplace = True)
time

,Country,B,D,Title,Category,Context,Category Ordinal,Lifespan,Birth Decade,Name Length,Initials
0,United States,1902.0,1974.0,US Air Mail Pilot,NaN,First Solo Transatlantic Flight,0,72.0,1900.0,17,CL
1,United States,1875.0,1940.0,Founder of Chrysler,Economics,Chrysler/Dodge Merger,12,65.0,1870.0,15,WC
2,United States,1874.0,1962.0,Member of the German Reparations International...,Diplomacy,Young Plan,4,88.0,1870.0,13,ODY
3,India,1869.0,1948.0,NaN,Revolution,Salt March,9,79.0,1860.0,14,MG
4,France,1883.0,1945.0,Prime Minister of France,Politics,NaN,5,62.0,1880.0,12,PL
...,...,...,...,...,...,...,...,...,...,...,...
86,United States,1961.0,NaN,President of the United States,Politics,Presidential Election,5,NaN,1960.0,12,BO
87,Vatican City,1936.0,NaN,Pope of the Roman Catholic Church,Religion,Papal Conclave,10,NaN,1930.0,12,PF
88,NaN,NaN,NaN,NaN,Science,Ebola Epidemic,7,NaN,NaN,18,TE
89,Germany,1954.0,NaN,Chancellor of Germany,Politics,Debt Crisis; Refugee Crisis; Paris Terrorist A...,5,NaN,1950.0,13,AM
90,United States,1946.0,NaN,President of the United States,Politics,Presidential Election,5,NaN,1940.0,12,DT

In [ ]:
# Sort columns
time =time.reindex(sorted(time.columns), axis=1)
time

,B,Birth Decade,Category,Category Ordinal,Context,Country,D,Initials,Lifespan,Name Length,Title
0,1902.0,1900.0,NaN,0,First Solo Transatlantic Flight,United States,1974.0,CL,72.0,17,US Air Mail Pilot
1,1875.0,1870.0,Economics,12,Chrysler/Dodge Merger,United States,1940.0,WC,65.0,15,Founder of Chrysler
2,1874.0,1870.0,Diplomacy,4,Young Plan,United States,1962.0,ODY,88.0,13,Member of the German Reparations International...
3,1869.0,1860.0,Revolution,9,Salt March,India,1948.0,MG,79.0,14,NaN
4,1883.0,1880.0,Politics,5,NaN,France,1945.0,PL,62.0,12,Prime Minister of France
...,...,...,...,...,...,...,...,...,...,...,...
86,1961.0,1960.0,Politics,5,Presidential Election,United States,NaN,BO,NaN,12,President of the United States
87,1936.0,1930.0,Religion,10,Papal Conclave,Vatican City,NaN,PF,NaN,12,Pope of the Roman Catholic Church
88,NaN,NaN,Science,7,Ebola Epidemic,NaN,NaN,TE,NaN,18,NaN
89,1954.0,1950.0,Politics,5,Debt Crisis; Refugee Crisis; Paris Terrorist A...,Germany,NaN,AM,NaN,13,Chancellor of Germany
90,1946.0,1940.0,Politics,5,Presidential Election,United States,NaN,DT,NaN,12,President of the United States

## Missing Data

### Fundamentals of missing data

In the previous example, you saw that some entries had `Nan` to fill in for **missing data**

Missing data is one of the most recurrent problems in data analysis

In fact, there are a lot of studies and methods on how to handle it!

We will work with a small dataset called [missing.csv](https://www.dropbox.com/s/5h4k4rszebd6p0n/missing.csv?raw=1) (it's the same as data.csv from last week, but now with missing values)

In [ ]:
df = pd.read_csv('https://www.dropbox.com/s/5h4k4rszebd6p0n/missing.csv?raw=1')
df

        Name   Age   Height
0       Nick  21.0     1.85
1      Chris  29.0  Unknown
2        Tim  28.0     1.75
3        Ron   NaN     1.81
4     Monica  35.0  Unknown
5  Cassandra  21.0     1.66

The first thing to notice is that the second column is being shown with decimals, even though they were integers in the original file

Moreover, the blank entry is displayed as `NaN`

`NaN` stands for *Not A Number* as is part of the floating point specification, typically used when a calculation has no valid numerical result

In fact, Python considers `NaN` as a floating point (or `float64`)

In [ ]:
df

        Name   Age   Height
0       Nick  21.0     1.85
1      Chris  29.0  Unknown
2        Tim  28.0     1.75
3        Ron   NaN     1.81
4     Monica  35.0  Unknown
5  Cassandra  21.0     1.66

In [ ]:
type(df.at[3, 'Age'])

numpy.float64

As a result, the entire column has been turned into `float64`, instead of `int64`

 This is why it was being shown as decimals!

In [ ]:
df['Age']

0    21.0
1    29.0
2    28.0
3     NaN
4    35.0
5    21.0
Name: Age, dtype: float64

### Incorrectly Imported Missing Data

The missing value in the `Age` column was generated because the cell was blank

By default, `Pandas` will treat certain cell values, such as a *blank*, `NULL`, `NaN`, and `n/a` as missing values

The `Height` column contains some entries which we recognise as missing data (i.e. `Unknown`) but that Pandas did not

In fact, the entire column has been imported as strings, not numbers!

In [ ]:
df

        Name   Age   Height
0       Nick  21.0     1.85
1      Chris  29.0  Unknown
2        Tim  28.0     1.75
3        Ron   NaN     1.81
4     Monica  35.0  Unknown
5  Cassandra  21.0     1.66

In [ ]:
print(df.at[1, 'Height'])
print(type(df.at[1, 'Height']))

Unknown
<class 'str'>

This in turn made `Pandas` believe that the whole column has strings!

In [ ]:
print(df.at[0, 'Height'])
print(type(df.at[0, 'Height']))

1.85
<class 'str'>

What happens if we multiply this column by `100`?

In [ ]:
df['Height times 100'] = df['Height'] * 100
df

        Name   Age   Height                                   Height times 100
0       Nick  21.0     1.85  1.851.851.851.851.851.851.851.851.851.851.851....
1      Chris  29.0  Unknown  UnknownUnknownUnknownUnknownUnknownUnknownUnkn...
2        Tim  28.0     1.75  1.751.751.751.751.751.751.751.751.751.751.751....
3        Ron   NaN     1.81  1.811.811.811.811.811.811.811.811.811.811.811....
4     Monica  35.0  Unknown  UnknownUnknownUnknownUnknownUnknownUnknownUnkn...
5  Cassandra  21.0     1.66  1.661.661.661.661.661.661.661.661.661.661.661....

We need to tell Pandas in advance to treat `Unknown` not as a string, but as a missing value

Lets re-import the data set passing a list of values which represent missing values as the `na_values` parameter

In [ ]:
df = pd.read_csv('https://www.dropbox.com/s/5h4k4rszebd6p0n/missing.csv?raw=1', 
                 na_values=['Unknown'])
df

        Name   Age  Height
0       Nick  21.0    1.85
1      Chris  29.0     NaN
2        Tim  28.0    1.75
3        Ron   NaN    1.81
4     Monica  35.0     NaN
5  Cassandra  21.0    1.66

Now the column is `float64`

In [ ]:
df['Height']

0    1.85
1     NaN
2    1.75
3    1.81
4     NaN
5    1.66
Name: Height, dtype: float64

Multiplying `Height` now works as expected.

In [ ]:
df['Height times 100'] = df['Height'] * 100
df

        Name   Age  Height  Height times 100
0       Nick  21.0    1.85             185.0
1      Chris  29.0     NaN               NaN
2        Tim  28.0    1.75             175.0
3        Ron   NaN    1.81             181.0
4     Monica  35.0     NaN               NaN
5  Cassandra  21.0    1.66             166.0

In [ ]:
# Another example
df['Test'] = df['Age'] + df['Height']
df

        Name   Age  Height  Height times 100   Test
0       Nick  21.0    1.85             185.0  22.85
1      Chris  29.0     NaN               NaN    NaN
2        Tim  28.0    1.75             175.0  29.75
3        Ron   NaN    1.81             181.0    NaN
4     Monica  35.0     NaN               NaN    NaN
5  Cassandra  21.0    1.66             166.0  22.66

### Methods to address missing data

As mentioned before, there are different ways to deal with missing data

The method you should use depends on your analysis, the application domain and what you want to achieve

Here are some common methods:

    1. Leave the missing values as NaN
    2. Lookup the values from another data source
    3. Delete the rows / observations
    4. Compute reasonable guesses about the values

In **option 1**, it is often reasonable to just leave the data as missing data

For example, if we wanted to calculate average `Height`, it may not matter that we are missing `Age` for one row

As for **option 2**, if we have some other ways of going back and getting correct data, we could just update the values with `df.at[3, 'Age'] = ...`

Let's assume we are going for **option 3** and want to remove any rows where we do no have `Age`

If we know the row we want to delete (`3`), we can use the `drop` method, only this time we specify rows, not columns. As in:

    df.drop(3)

However, often there are many missing values, and we don't want to check on the index of each

A good way to remove rows with missing data is to specify which rows to **keep**

The `isnull` method will filter for rows which contains `NaN`.

In [ ]:
df[df['Age'].isnull()]

  Name  Age  Height  Height times 100  Test
3  Ron  NaN    1.81             181.0   NaN

Of course, this is the *opposite* of specifying which to keep

The **notnull** method will show us which rows do not contain `NaN` in the specified column.

In [ ]:
df[df['Age'].notnull()]

        Name   Age  Height  Height times 100   Test
0       Nick  21.0    1.85             185.0  22.85
1      Chris  29.0     NaN               NaN    NaN
2        Tim  28.0    1.75             175.0  29.75
4     Monica  35.0     NaN               NaN    NaN
5  Cassandra  21.0    1.66             166.0  22.66

Notice that the filter is only checking the column we specified `Age`, not the other column with `NaN` values

We can apply the filter by assigning the result back to `df`

In [ ]:
df = df[df['Age'].notnull()]
df

        Name   Age  Height  Height times 100   Test
0       Nick  21.0    1.85             185.0  22.85
1      Chris  29.0     NaN               NaN    NaN
2        Tim  28.0    1.75             175.0  29.75
4     Monica  35.0     NaN               NaN    NaN
5  Cassandra  21.0    1.66             166.0  22.66

Since the `Age` column no longer contains any non-integers, it is safe to convert the column to `int64` type

We can do this with the `astype` method

In [ ]:
df = df.astype({'Age': 'int64'})
df

        Name  Age  Height  Height times 100   Test
0       Nick   21    1.85             185.0  22.85
1      Chris   29     NaN               NaN    NaN
2        Tim   28    1.75             175.0  29.75
4     Monica   35     NaN               NaN    NaN
5  Cassandra   21    1.66             166.0  22.66

### Updating Indices

After these operations, the current data frame has the index 0, 1, 2, 4, 5

We could leave it like this, being careful to select the correct rows with `loc`. However, we can also reset the index with `reset_index`

Note that we need to specify `drop=True`, without this we will end up with an extra column with the old index

In [ ]:
df = df.reset_index(drop=True)
df

        Name  Age  Height  Height times 100   Test
0       Nick   21    1.85             185.0  22.85
1      Chris   29     NaN               NaN    NaN
2        Tim   28    1.75             175.0  29.75
3     Monica   35     NaN               NaN    NaN
4  Cassandra   21    1.66             166.0  22.66

Alternatively, we can set the index to a particular column if we don't want default indexing

In [ ]:
df = df.set_index('Name')
df

           Age  Height  Height times 100   Test
Name
Nick        21    1.85             185.0  22.85
Chris       29     NaN               NaN    NaN
Tim         28    1.75             175.0  29.75
Monica      35     NaN               NaN    NaN
Cassandra   21    1.66             166.0  22.66

Say we want to go with **option 4** and replace missing `Height` with a computed value

In this example we simply calculate the mean height of other people in the data set (to the nearest cm)

**Note:** The `mean` method just ignores the missing data and gives us the average of the non-missing data, which is what we want

In [ ]:
mean_height = df['Height'].mean()
mean_height

1.7533333333333332

In [ ]:
mean_height = round(mean_height, 
                    2)
mean_height

1.75

Of course there are many more sophisticated ways to predict a replacement value!

For instance, could fit a regression with `Age`

Or if we had categories such as `Gender` we could group by categories and do predictions for each

In this example we will just use `1.75` for every missing value.

In [ ]:
df = df.fillna({'Height' : mean_height})
df

           Age  Height  Height times 100   Test
Name
Nick        21    1.85             185.0  22.85
Chris       29    1.75               NaN    NaN
Tim         28    1.75             175.0  29.75
Monica      35    1.75               NaN    NaN
Cassandra   21    1.66             166.0  22.66

# Lab

There are two notebooks, one for each topic

    - Manipulating columns
    - Missing data

In addition, you can do the DataCamp corresponding assessments/courses